Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F09A.tmx
Source language: en_us
Languages: zh_cn

source: Relish the Moment
zh_cn: 享受当下

source: Tucked away in our subconsciousness is an idyllic vision.
zh_cn: 我们的潜意识里藏着一派田园诗般的风光。

source: We see ourselves on a long trip that spans the continent.
zh_cn: 我们置身在一场横贯大陆的长途旅程中。

source: We are travelling by train. Out the windows, we drink in the passing scene of cars on nearby highways, of children waving on a crossing, of cattle grazing on a distant hillside, of smoke pouring from a power plant, of row upon row of corn and wheat, of flatlands and valleys, of mountains and rolling hillsides, of city skylines and village halls.
zh_cn: 我们乘着火车，欣赏窗外变幻的景色：高速公路上奔驰的汽车、十字路口招手的孩子、远山上吃草的牛群、从电厂滚滚排出的烟尘、成片的玉米和小麦、平原与山谷、群山与绵延起伏的丘陵、天空映衬下城市的轮廓线，以及乡间的土坡。

source: But the uppermost in our minds is the final destination.
zh_cn: 然而在我们心里最重要的却是最终的目的地。

source: On a certain day at a certain hour, we will pull into the station.
zh_cn: 在某一天的某一时刻, 我们将会抵达进站。

source: Bands will be playing and flags waving.
zh_cn: 迎接我们的将是乐队和飘舞的彩旗。

source: Once we reach there, so many wonderful dreams will come true and the pieces of our lives will be fit together like a completed jigsaw puzzle.
zh_cn: 一旦到了那里，许多美梦将变成现实, 我们的生活也将变得完整, 像一张拼好了的拼图。

source: How restlessly we pace the aisles, damning the minutes loitering, waiting, waiting, waiting for the station.
zh_cn: 于是我们现在在过道里不安地踱来踱去, 咒骂时间的缓慢。我们期盼着, 期盼着, 期盼着进站的那一刻。

source: "When we reach the station, that will be it", we cry.
zh_cn: “当我们到站时，一切都好了！”我们呼喊着。

source: "When I'm 18", "When I buy a new 450SL Mercedes Benz", "When I put my last kid through collage", "When I have paid off the mortgage", "When I get a promotion", "When I reach the age of the retirement, I shall live happily ever after."
zh_cn: “当我十八岁的时候！”“当我买了一辆崭新的奔驰450SL的时候！”“当我最小的孩子上完大学的时候！”“当我还清贷款的时候！”“当我升官的时候！”“当我退休过上幸福生活的时候！”

source: Sooner or later, we must realize that there is no station, no one place to arrive at once and for all.
zh_cn: 不久的以后，我们终将会意识到人生的旅途并没有车站, 也没有能够一到永逸的地方。

source: The true joy of life is the trip. The station is only a dream. It constantly outdistances us.
zh_cn: 生活的真正乐趣在于旅行的过程, 车站只不过是个梦, 它一直遥遥领先于我们。

source: "Relish the moment" is a good motto, especially when coupled withe the Psalm 118:24: "This is the day which the Lord hath made, we will rejoice and be glad in it."
zh_cn: “享受当下"是句很好的箴言, 尤其是当它与《圣经·诗篇》中第118页24行中一段话相对应的时候："今日乃主所创造；生活在今日我们将欢欣、高兴。

source: It isn't the burdens of today that drive men mad. It is the regrets over yesterday and the fear of tommorrow.
zh_cn: "真正令人发疯的不是今日的负担, 而是对昨日的悔恨及对明日的恐惧。

source: Reget and fear are twin thieves who rob us of today.
zh_cn: 悔恨与恐惧是一对孪生的窃贼, 将今天从你我身边掠走。

source: So stop pacing the aisles and counting the miles.
zh_cn: 所以停止在过道里徘徊, 别老计算着离车站还有多远。

source: Instead, climb more mountains, eat more icecreams, go barefoot more often, swim more rivers, watch more sunsets, laugh more and cry less.
zh_cn: 相反， 攀登更多的高山， 多吃点儿冰淇淋, 多光着脚走走, 游更多的河, 多看看夕阳西下, 多点欢声笑语, 少点泪水苦涩。

source: Life must be lived as we go along.
zh_cn: 生活要且行且珍惜。

source: Then the station will come soon enough.
zh_cn: 车站很快就会到达。
